Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་མངོན་པར་བསྒྲུབས་པ་ཡང་རྣལ་འབྱོར་ཡོངས་སུ་རྫོགས་པའི་བར་དུ་མངོན་པར་བསྒྲུབས་པས་རྣལ་འབྱོར་བསྒོམས་པའི་སྟོབས་ཀྱིས་ནི་མངའ་ཆེན་པོ་བརྙེས་ལ།
en: Though they accomplished them, they continued to accomplish them until they had perfected their practice, so that through the strength of their meditation practice they gained great mastery.

source: མངའ་ཆེན་པོ་བརྙེས་པའི་མཐུས་ནི་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་དང་སེམས་ཅན་གྱི་སྤྱོད་པ་ཇི་ལྟ་བ་དང་སེམས་ཅན་གྱི་ཁམས་ཇི་ལྟ་བ་བཞིན་དུ་ཐམས་ཅད་ཐུགས་སུ་ཆུད་པས་དུས་ལ་ཡང་མི་གཞེས་ཤིང་། དུས་དང་གནས་ལས་ཀྱང་ཡོལ་བར་མི་མཛད་པས་དུས་དང་མཐུན་ཞིང་སྤྱོད་པ་དང་མཐུན་པར་རྗེས་སུ་མཐུན་པའི་ཆོས་སྟོན་པ་དང་། སྐུ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་སྤྲུལ་པའི་སྐུ་ཞེས་བྱའོ།
en: Through the power of that great mastery, they understood what the aspirations of all beings were, what the types of conduct of all beings were, what the natures of all beings were, and without engaging in time or missing a time or place, they teach the appropriate Dharma in accordance with the time and with those types of conduct, and the various kinds of bodies that they manifest are called emanation bodies. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མངོན་པར་རྟོགས་པ་འཐོབ་པར་བྱ་བའི་ཕྱིར་དང་། དོན་དམ་པའི་བདེན་པ་བསྟན་ནས་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་རོ་གཅིག་པ་ཉིད་དུ་ཤེས་པར་བྱ་བའི་ཕྱིར་དང་།
en: Noble one, how should bodhisattvas understand the enjoyment body?

source: འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་བསལ་ནས་འཇིགས་ཤིང་སྐྲག་པ་དང་རབ་ཏུ་དགའ་བ་བསྐྱེད་པའི་ཕྱིར་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མཐའ་མེད་པའི་གཞི་མཛད་པའི་ཕྱིར་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་དང་རྗེས་སུ་མཐུན་པའི་ཕྱིར་སྐུ་གང་གིས་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཕུན་སུམ་ཚོགས་པ་དང་།
en: In this way: in order that bodhisattvas will attain realization, in order to teach the ultimate truth so that they will know the one taste of saṃsāra and nirvāṇa, in order to dispel the view of belief in a self, in order to make frightened and terrified beings become happy, in order to create the basis for endless Dharmas of the buddhas, and in order to be exactly in accord with the true nature, the wisdom of the true nature, and the power of past prayers, the tathāgatas have bodies with the perfection of the thirty-two signs and eighty features of a great being, with perfect auras of light around their heads and bodies.

source: དབུ་དང་། རྒྱབ་ཀྱི་འོད་ཡོངས་སུ་རྫོགས་པ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཞེས་བྱའོ།
en: Those are what are called the enjoyment bodies. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཆོས་ཀྱི་སྐུ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: Noble one, how should bodhisattvas mahāsattvas understand the Dharma body?

source: ཉོན་མོངས་པའི་སྒྲིབ་པ་ལ་སོགས་པ་ཡོངས་སུ་བསལ་ནས་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པའི་ཕྱིར་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ཁོ་ན་དང་ལྡན་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུ་ཞེས་བྱའོ།
en: Because the kleśa obscurations and so on have been completely dispelled and virtuous qualities have been made totally complete, there is solely the possession of the true nature and the wisdom of the true nature. That is what is called the Dharma body. “

source: །སྐུ་སྔ་མ་རྣམ་པ་གཉིས་ནི་བཏགས་པ་ཙམ་དུ་ཡོད་པ་ཡིན་ལ་སྐུ་གསུམ་པ་འདི་ནི་ཡང་དག་པར་ཡོད་པ་ཡིན་ཏེ། སྐུ་སྔ་མ་གཉིས་ཀྱི་རྩ་བར་གྱུར་པའི་ཕྱིར་རོ།
en: The first two bodies are merely designations, while the Dharma body is true and the basis for those two bodies.

source: ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ལས་མ་གཏོགས་པར་སངས་རྒྱས་ཐམས་ཅད་ལས་གུད་ན་ཆོས་གཞན་མི་མངའ་སྟེ།
en: It is because there is only the true nature of phenomena and nonconceptual wisdom, and there are no other qualities that are separate from all buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ནི་མཁྱེན་པ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ན་ཉོན་མོངས་པ་ཐམས་ཅད་གཏན་དུ་ཉེ་བར་ཞི་ཞིང་ཟད་ནས་སངས་རྒྱས་ཀྱིས་རྣམ་པར་དག་པ་བརྙེས་པར་འགྱུར་བས།
en: All buddhas have a perfection of wisdom, and all their kleśas have completely ceased and ended so that the buddhas have attained purity.

source: དེའི་ཕྱིར་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་འགྱུར་རོ།
en: Therefore, all buddha qualities are contained within the true nature and the wisdom of the true nature. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཐམས་ཅད་ནི་བདག་དང་གཞན་ལ་ཕན་འདོགས་པའི་མཐར་བྱོན་པ་ཡིན་པས། བདག་ལ་ཕན་འདོགས་པ་ནི་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དོ། །གཞན་ལ་ཕན་འདོགས་པ་ནི་དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་སོ།
en: Moreover, noble one, all buddhas have attained the mastery of benefit for oneself and for others; the benefit for oneself is the true nature of phenomena, and the benefit for others is the wisdom of the true nature.

source: །བདག་དང་གཞན་ལ་ཕན་འདོགས་པར་མཛད་པ་ལ་མངའ་བརྙེས་ནས་མཛད་པ་མཐའ་ཡས་པ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པའི་ཕྱིར་དེ་ལྟ་བས་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བྱེ་བྲག་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་ཅིང་མཐའ་མེད་པ་སྙེད་ཡོད་པར་རྣམ་པར་ཕྱེ་བ་ཡིན་ནོ།
en: Because they have attained the power to benefit self and others, there is a perfect variety of endless deeds, and thus they reveal the endless, countless specific and different varieties of all the Dharmas of the buddhas. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པ་ལ་བརྟེན་ནས་ཉོན་མོངས་པ་རྣམ་པ་སྣ་ཚོགས་དང་། ལས་ཀྱི་རྒྱུ་རྣམ་པ་སྣ་ཚོགས་དང་། འབྲས་བུ་རྣམ་པར་སྨིན་པ་རྣམ་པ་སྣ་ཚོགས་བསྟན་པ་དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་།
en: As an analogy, noble one, on the basis of incorrect thought, various kleśas, various karmic causes, and various ripened results are manifested.

source: དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་བརྟེན་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་མཛད་དོ། །ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་།
en: In the same way, on the basis of the true nature of phenomena and the wisdom of the true nature, the various kinds of qualities of the buddhas, the various kinds of qualities of the pratyekabuddhas, and the various kinds of qualities of the śrāvakas are manifested. “

source: དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་བརྟེན་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་རང་དབང་ཐོབ་ནས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བས་འདི་ནི་མཆོག་ཏུ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱའོ།
en: On the basis of the true nature of phenomena and the wisdom of the true nature, there is the attainment of the power over the qualities of buddhahood, which are supremely inconceivable.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་རི་མོ་བྲིས་ཏེ་རྒྱན་དུ་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་ནོ། །དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་བརྟེན་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་ནོ།
en: As an analogy, adorning the sky by painting a picture on it is inconceivable; in the same way, the accomplishment of the qualities of buddhahood on the basis of the true nature of phenomena and the wisdom of the true nature is inconceivable. “

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་གཉིས་ལ་རྣམ་པར་རྟོག་པ་མི་མངའ་བར་ཡང་རང་གི་ངང་གིས་མཛད་པའི་དངོས་པོ་དག་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཞེ་ན།
en: Noble one, when there are no thoughts within the true nature of phenomena and the wisdom of the true nature, how can it have perfect, spontaneous activity? “

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་སྨོན་ལམ་ལ་མངའ་བརྙེས་པའི་ཕྱིར་མཛད་པའི་དངོས་པོ་རྣམ་པ་སྣ་ཚོགས་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་།
en: As an example, noble one, although the tathāgatas pass into nirvāṇa, because they have attained mastery of prayer, there is a perfection of various kinds of activities.

source: དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་མཛད་པའི་དངོས་པོ་དེ་དག་ཡོངས་སུ་གྲུབ་པ་ལ་མངའ་བརྙེས་པ་ཡང་དེ་བཞིན་ནོ།
en: In the same way, the true nature and the wisdom of the true nature have attained mastery over the accomplishment of deeds. “

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སེམས་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་ཀྱང་སྔོན་གྱི་སྨོན་ལམ་ལ་བརྟེན་ནས་ཏིང་ངེ་འཛིན་ལས་ལངས་ཏེ་བྱ་བ་མང་པོ་རྣམས་ལ་མངོན་པར་འདུ་བྱེད་དོ།
en: Also, although bodhisattvas mahāsattvas enter equanimity within samādhi, because of their past prayers they rise from that samādhi and engage in many activities. “

source: །དེ་བཞིན་དུ་ཆོས་གཉིས་པོ་དག་ལ་རྣམ་པར་རྟོག་པ་མི་མངའ་བར་ཡང་རང་གི་ངང་གིས་མཛད་པ་དག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Similarly, although there are no thoughts in either of those qualities, there is a spontaneous perfection of activities. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་ཉི་མ་དང་ཟླ་བ་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད། ཆུ་དང་མེ་ལོང་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད། འོད་སྣང་བ་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད་མོད་ཀྱི། འོན་ཀྱང་གསུམ་འདུས་པ་ལས་གཟུགས་བརྙན་འབྱུང་བར་འགྱུར་རོ།
en: As an analogy, noble one, the sun and moon have no thoughts, water and mirrors have no thoughts, and light has no thoughts; nevertheless, the combination of these three causes reflections to appear.

source: །དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་ཡང་རྣམ་པར་རྟོག་པ་མི་མངའ་མོད་ཀྱི། འོན་ཀྱང་སྨོན་ལམ་ལ་མངའ་བརྙེས་པའི་ཕྱིར་སེམས་ཅན་སྐལ་བ་དང་ལྡན་པ་དག་ལ་ལོངས་སྤྱོད་རྫོགས་པ་དང་། སྤྲུལ་པའི་སྐུ་ཉི་ཟླའི་གཟུགས་བརྙན་འདུས་པ་ལས་སྣང་བ་བཞིན་དུ་སྟོན་པར་མཛད་དོ།
en: In the same way, there are no thoughts in the true nature of phenomena and the wisdom of that true nature; nevertheless, because of the mastery of prayer, in the same way that through a combination of factors the reflections of the sun and moon appear, through a combination of factors the enjoyment bodies and the emanation bodies manifest their appearances to beings who are worthy. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་ཚད་མེད་དཔག་ཏུ་མེད་པའི་ཆུ་དང་མེ་ལོང་དག་འོད་སྣང་བ་ལ་བརྟེན་པའི་ཕྱིར་ནམ་མཁའ་ལ་གཟུགས་བརྙན་མཚན་མ་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད་ཀྱང་ནམ་མཁའ་ནི་མཚན་མ་མེད་པ་ཉིད་དོ།
en: Moreover, noble one, extending the analogy, there are countless, innumerable waters and mirrors, and because of light, they manifest various kinds of different characteristics of reflections in space, but space has no characteristics. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་སློབ་མ་རྣམས་འདུལ་བ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུའི་གཟུགས་བརྙན་ཡིན་ཏེ།
en: In the same way, noble one, that which guides pupils are the reflections of the Dharma body.

source: སྨོན་ལམ་གྱི་མཐུས་སྐུ་རྣམ་པ་གཉིས་ལས་མཚན་མ་རྣམ་པ་སྣ་ཚོགས་སྣང་ཡང་ཆོས་ཀྱི་སྐུའི་ས་ལ་ནི་ཐ་དད་པའི་མཚན་མ་མི་མངའོ།
en: Through the power of prayers, the various features appear from the other two bodies, but on the level of the Dharma body there are no diverse features. “

source: །རིགས་ཀྱི་བུ་སྐུ་གཉིས་པོ་དེ་དག་ལ་བརྟེན་ནས་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལྷག་མ་དང་བཅས་པའི་མྱ་ངན་ལས་འདས་པ་བསྟན་ཏོ།
en: Noble one, it is on the basis of those two bodies that it is taught that there is the nirvāṇa with a remainder of all buddhas.

source: །ཆོས་ཀྱི་སྐུ་དེ་ལ་བརྟེན་ནས་ནི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་བསྟན་ཏོ།
en: It is on the basis of the Dharma body that it is taught that there is nirvāṇa without a remainder.

source: ཆོས་ཐམས་ཅད་ནི་མཐར་ཟད་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: It is because that is the final cessation of all phenomena.

source: །སྐུ་གསུམ་པོ་འདི་དག་ལ་བརྟེན་ནས་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་བསྟན་ཏོ།
en: It is on the basis of all these three bodies that it is taught that there is the nirvāṇa without location of all buddhas. “

source: །སྐུ་གཉིས་ཀྱི་ཕྱིར་ནི་མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་ཏེ། ཆོས་ཀྱི་སྐུ་ལས་གུད་ན་ཡང་སངས་རྒྱས་གཞན་མེད་པས་སོ།
en: There is no remaining in nirvāṇa because of the two bodies, for there is no buddhahood other than the Dharma body. “

source: །ཅིའི་ཕྱིར་སྐུ་གཉིས་མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་ཞེ་ན།
en: Why are the two bodies said to not be in nirvāṇa?

source: སྐུ་གཉིས་པོ་དེ་དག་ནི་བརྟགས་པ་ཙམ་སྟེ། ཡང་དག་པ་མ་ཡིན་པས་སྐད་ཅིག་མར་སྐྱེ་ཞིང་འགག་པ་དང་བཅས་པས་ངེས་པར་མི་གནས་པའི་ཕྱིར་ཡང་དང་ཡང་དུ་འབྱུང་ཞིང་ངེས་པ་མེད་པའི་ཕྱིར་རོ།
en: Because those two bodies are merely designations and have no validity; they arise and cease with each instant and are not definitively present. They are not definitive because they arise repeatedly.

source: །ཆོས་ཀྱི་སྐུ་ནི་དེ་ལྟ་མ་ཡིན་པས་དེའི་ཕྱིར་སྐུ་གཉིས་པོ་མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་སོ།
en: The Dharma body is not like that, and therefore those two bodies are not ‘nirvāṇa.’

source: །ཆོས་ཀྱི་སྐུ་ནི་གཉིས་སུ་མེད་པས་དེའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་ཏེ།
en: The Dharma body is nondual in relation to them, and therefore it does not dwell in nirvāṇa.

source: དེ་ལྟ་བས་ན་སྐུ་གསུམ་པོ་དེ་དག་ལ་བརྟེན་ནས་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་བསྟན་པ་ཡིན་ནོ།
en: Therefore, it is on the basis of all three bodies that ‘nirvāṇa without location’ is taught. “

source: །རིགས་ཀྱི་བུ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་མཚན་ཉིད་གསུམ་དང་ལྡན་པའི་ཕྱིར་འཆིང་བ་དང་བཅས་ཤིང་སྒྲིབ་པ་དང་བཅས་པས་སྐུ་གསུམ་པོ་དག་ཐག་རིང་དུ་སྤོང་ཞིང་སྐུ་གསུམ་པོ་དག་དང་ཉེ་བར་མི་འགྱུར་རོ།
en: Noble one, all ordinary beings are in bondage and have obscurations because of having three characteristics, and as a result are far from the three bodies.

source: །གསུམ་གང་ཞེ་ན།
en: What are those three?

source: ཀུན་ཏུ་བརྟགས་པའི་མཚན་ཉིད་དང་། གཞན་གྱི་དབང་ལས་བྱུང་བའི་མཚན་ཉིད་དང་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དོ།
en: They are the characteristic of the imputed, the characteristic of the dependent, and the characteristic of the ultimately real. “

source: །འདི་ལྟར་མཚན་ཉིད་འདི་དག་ཡོངས་སུ་མ་ཤེས་པའི་ཕྱིར་དང་ཞི་བར་མ་གྱུར་པའི་ཕྱིར་དང་ཡོངས་སུ་མ་དག་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བས་ན་སྐུ་གསུམ་པོ་འདི་དག་དང་ཉེ་བར་མ་གྱུར་པ་ཡིན་ནོ།
en: It is because those characteristics are not known, have not ceased, and are not purified that they are not close to the three bodies.

source: །འདི་ལྟར་མཚན་ཉིད་གསུམ་པོ་འདི་དག་ཤེས་ཤིང་ཉེ་བར་ཞི་བ་དང་ཡོངས་སུ་དག་པར་གྱུར་པའི་ཕྱིར་དེ་ལྟ་བས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སྐུ་གསུམ་དང་ལྡན་པར་འགྱུར་བ་ཡིན་ནོ།
en: It is because those characteristics are known, have ceased, and are purified that the buddha bhagavats possess the three bodies. “

source: །རིགས་ཀྱི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་སེམས་རྣམ་པ་གསུམ་པོ་འདི་དག་མ་སྤངས་པའི་ཕྱིར་སྐུ་གསུམ་པོ་དག་ཐག་རིང་དུ་སྤངས་ནས་ཉེ་བར་མི་འགྱུར་བ་ཡིན་ནོ།
en: Noble one, childlike, ordinary beings are far from the three bodies because they have not freed themselves from the three consciousnesses.

source: བྱ་བ་སློང་བའི་སེམས་དང་། རྩ་བ་ལ་བརྟེན་པའི་སེམས་དང་།
en: They are the consciousness that engages with things, the mentation that resides on the basis, and the basis consciousness. “

source: རྩ་བའི་སེམས་གང་ཡིན་པའོ། །ཐུལ་བར་བྱེད་པའི་ལམ་རྣམས་ལ་བརྟེན་ནས་ནི་བྱ་བ་སློང་བའི་སེམས་ཟད་པར་འགྱུར་རོ།
en: The engaging consciousness ceases through the path of subjugation.

source: །ཆོས་ཀྱིས་སྤོང་བའི་ལམ་ལ་བརྟེན་ནས་ནི་རྩ་བ་ལ་བརྟེན་པའི་སེམས་ཟད་པར་འགྱུར་རོ།
en: The mentation that resides on the basis ceases through following the path of elimination.

source: །མཆོག་ཏུ་འགྱུར་བའི་ལམ་ལ་བརྟེན་ནས་ནི། རྩ་བའི་སེམས་ཟད་པར་འགྱུར་རོ།
en: The basis consciousness is purified through the supreme path. “

source: །བྱ་བ་སློང་བའི་སེམས་ཉེ་བར་ཞི་བར་གྱུར་པའི་ཕྱིར་ནི་སྤྲུལ་པའི་སྐུ་སྟོན་པར་འགྱུར་རོ།
en: The emanation body manifests because the engaging consciousness ceases.

source: །རྩ་བ་ལ་བརྟེན་པའི་སེམས་ཉེ་བར་ཞི་བར་གྱུར་པའི་ཕྱིར་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་སྟོན་པར་འགྱུར་རོ།
en: The enjoyment body manifests when the mentation that resides on the basis ceases.

source: །རྩ་བའི་སེམས་ཉེ་བར་ཞི་བར་གྱུར་པའི་ཕྱིར་ནི་ཆོས་ཀྱི་སྐུ་འཐོབ་པར་འགྱུར་བས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐུ་གསུམ་དང་ལྡན་པར་གྱུར་པ་ཡིན་ནོ།
en: The Dharma body is attained because the basis consciousness is purified. That is why the tathāgatas possess the three bodies. “

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཐམས་ཅད་ནི་སྐུ་དང་པོའི་དབང་གིས་སངས་རྒྱས་རྣམས་དང་མཛད་པ་མཚུངས་པ་དང་། སྐུ་གཉིས་པའི་དབང་གིས་སངས་རྒྱས་རྣམས་དང་དགོངས་པ་མཚུངས་པ་དང་། སྐུ་གསུམ་པའི་དབང་གིས་སངས་རྒྱས་རྣམས་དང་སྐུ་མཚུངས་པར་གྱུར་པ་ཡིན་ནོ།
en: Noble one, through the power of the first of those bodies, the buddhas have the same activity; through the power of the second of those bodies, the buddhas have the same intent; and through the power of the third body, the buddhas have the same body. “

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་རྣམས་ཀྱི་སྐུ་དང་པོ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་གྱི་མོས་པའི་རྗེས་སུ་རྣམ་པ་མང་པོ་དང་ལྡན་པའི་ཕྱིར་མཚན་ཉིད་སྣ་ཚོགས་སྟོན་པར་མཛད་པས་དེའི་ཕྱིར་མང་པོར་བསྟན་པ་ཡིན་ནོ།
en: Noble one, that which is the first body of the buddhas has many forms in accord with the aspirations of beings, and therefore it manifests various characteristics and so it is taught to be multiple.

source: །སངས་རྒྱས་ཀྱི་སྐུ་གཉིས་པ་གང་ཡིན་པ་དེ་ནི་སློབ་མ་རྣམས་ཡིད་གཅིག་ཏུ་གྱུར་པའི་ཕྱིར་མཚན་ཉིད་གཅིག་ཁོ་ན་སྟོན་པར་མཛད་པས་དེའི་ཕྱིར་གཅིག་ཏུ་བསྟན་པ་ཡིན་ནོ།
en: The second body of the buddhas, because its disciples have one mentality, manifests a single characteristic, and so it is taught to be single.

source: །སངས་རྒྱས་ཀྱི་སྐུ་གསུམ་པ་གང་ཡིན་པ་དེ་ནི་མཚན་མ་གཉིས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀུན་ཏུ་ཁྱབ་ཅིང་མཚན་ཉིད་དུ་འཛིན་པའི་སྤྱོད་ཡུལ་མ་ཡིན་པས་དེའི་ཕྱིར་གཅིག་པ་ཡང་མ་ཡིན་ཐ་དད་པ་ཡང་མ་ཡིན་པ་ཞེས་བསྟན་ཏོ།
en: The third body of the buddhas pervades all the forms of those two characteristics and is not a field of experience that possesses characteristics, and therefore it is taught to be neither the same nor different. “

source: །རིགས་ཀྱི་བུ་སྐུ་དང་པོ་གང་ཡིན་པ་དེ་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ལ་བརྟེན་ནས་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: Noble one, that which is the first body appears on the basis of the enjoyment body.

source: །སྐུ་གཉིས་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུ་ལ་བརྟེན་ནས་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: That which is the second body appears on the basis of the Dharma body.

source: །ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པར་ཡོད་པ་མ་ཡིན་པས་བརྟེན་པའི་གནས་ཅི་ཡང་མི་མངའོ།
en: That which is the Dharma body is not truly existent, and so it is not based on anything. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟར་ཆོས་གསུམ་པོ་དེ་དག་ནི་རྟག་པའི་དོན་དང་ལྡན་པའི་ཕྱིར་ནི་རྟག་པ་ཞེས་བྱའོ། །བསྟན་ལ་མི་རྟག་པའི་དོན་དང་ལྡན་པའི་ཕྱིར་ནི་མི་རྟག་པ་ཞེས་བསྟན་ཏེ།
en: Noble one, because those three qualities have permanence, they are called permanent. “

source: སྤྲུལ་པའི་སྐུ་གང་ཡིན་པ་དེ་ནི་རྟག་པར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཞིང་དེ་དང་དེ་དག་ཏུ་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་ཐབས་མཁས་པ་སྟོན་པ་ལ་རྒྱུན་འཆད་པ་མེད་པའི་ཕྱིར་དེ་ལྟ་བས་ན་རྟག་པ་ཞེས་བསྟན་ཏོ།
en: That which is an emanation body always turns the Dharma wheel, and here and there, in accord with circumstances, continuously manifests skillful methods. In that way it is said to be permanent.

source: །རྩ་བ་མ་ཡིན་པའི་ཕྱིར་དང་ཕུན་སུམ་ཚོགས་པའི་མཛད་པ་ཆེན་པོ་མངོན་དུ་མི་འབྱུང་བའི་ཕྱིར་དེ་ལྟ་བས་ན་མི་རྟག་པ་ཞེས་བསྟན་ཏོ།
en: It is taught to be impermanent because it is not the basis and because the activity of perfection does not manifest. “

source: །ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་གང་ཡིན་པ་དེ་ནི་ཐོག་མ་མེད་པའི་དུས་ནས་རྒྱུན་འཆད་པ་མེད་པར་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མ་འདྲེས་པའི་ཆོས་རྣམས་ཡོངས་སུ་སྡུད་ཅིང་འཛིན་པའི་ཕྱིར་དང་། སེམས་ཅན་ཟད་པ་མེད་པ་བཞིན་དུ་མཛད་པ་ལ་ཡང་ཟད་པ་མི་མངའ་བའི་ཕྱིར་རྟག་པ་ཞེས་བསྟན་ཏོ།
en: That which is the enjoyment body is said to be permanent because continuously, throughout beginningless time, it has accumulated and possesses the unique qualities of all the buddhas, and just as there is no end to beings, there is no end to its activity.

source: །རྩ་བ་མ་ཡིན་པའི་ཕྱིར་དང་ཕུན་སུམ་ཚོགས་པའི་མཛད་པ་ཆེན་པོ་མངོན་དུ་མི་འབྱུང་བའི་ཕྱིར་མི་རྟག་པ་ཞེས་བསྟན་ཏོ།
en: It is said to be impermanent because it is not the basis, because the activity of perfection does not manifest. “

source: །ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་འདུ་བྱེད་པའི་ཆོས་ཀྱང་མ་ཡིན་ལ་ཐ་དད་པའི་མཚན་ཉིད་ཀྱང་མི་མངའ་ཞིང་རྩ་བ་ཡིན་པར་གྱུར་པའི་ཕྱིར་དང་།
en: That which is the Dharma body is not a composite phenomenon and has no diverse characteristics because it is the basis.

source: ནམ་མཁའ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་རྟག་པ་ཞེས་བསྟན་ཏོ།
en: It is taught to be permanent because it is the same as space. “

source: །རིགས་ཀྱི་བུ་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ལས་གུད་ན་མཆོག་ཏུ་གྱུར་པའི་ཡེ་ཤེས་མེད་ལ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་མཆོག་ཏུ་གྱུར་པའི་སྤྱོད་ཡུལ་མེད་པས་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་དང་།
en: Noble one, there is no supreme wisdom other than nonconceptual wisdom. There is no superior field of experience other than the true nature of phenomena.

source: ཤེས་རབ་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེའི་དེ་བཞིན་ཉིད་རྣམ་པ་གཉིས་པོ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་ཡང་མ་ཡིན། ཐ་དད་པ་ཡང་མ་ཡིན་ཏེ།
en: And so those two true natures—that which is the true nature of phenomena and the true nature of wisdom—are not a single true nature and not separate true natures.

source: དེའི་ཕྱིར་ཆོས་ཀྱི་སྐུ་ནི་ཤེས་རབ་རྣམ་པར་དག་པར་གྱུར་པའི་ཕྱིར་དང་། འགོག་བ་རྣམ་པར་དག་པར་གྱུར་པའི་ཕྱིར་གཉིས་རྣམ་པར་དག་པར་གྱུར་པ་ཡིན་པས་དེས་ན་ཆོས་ཀྱི་སྐུ་ནི་རྣམ་པར་དག་པ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་ཡིན་ནོ།
en: Therefore, because the Dharma body is pure wisdom and pure cessation, because it is those two purities, the Dharma body is the perfection of purity. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་སྐུ་གསུམ་པོ་དག་རབ་ཏུ་རྣམ་པར་དབྱེ་ན་ཐ་དད་པ་རྣམ་པ་བཞིར་འགྱུར་ཏེ། སྤྲུལ་པའི་སྐུ་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་མ་ཡིན་པ་ཡང་ཡོད། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡིན་ལ་སྤྲུལ་པའི་སྐུ་མ་ཡིན་པ་ཡང་ཡོད། སྤྲུལ་པའི་སྐུ་ཡང་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་ཡིན་པ་ཡང་ཡོད། སྤྲུལ་པའི་སྐུ་ཡང་མ་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་མ་ཡིན་པ་ཡང་ཡོད་དོ།
en: Moreover, noble one, there are four ways to categorize these three bodies: that which is the emanation body but not the enjoyment body; that which is the enjoyment body but not the emanation body; that which is both the emanation body and the enjoyment body; and that which is neither the emanation body nor the enjoyment body. “

source: །སྤྲུལ་པའི་སྐུ་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་མ་ཡིན་པ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What is it that is the emanation body but not the enjoyment body?

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་སྨོན་ལམ་ལ་མངའ་བརྙེས་པའི་ཕྱིར་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་ཕན་འདོགས་པ་གང་ཡིན་པ་དེ་ནི་སྤྲུལ་པའི་སྐུ་ཞེས་བྱའོ།
en: After a tathāgata has passed into nirvāṇa, because of having attained the power of prayer, there is benefit in accordance with conditions, and that is an emanation body. “

source: །ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡིན་ལ་སྤྲུལ་པའི་སྐུ་མ་ཡིན་པ་གང་ཞེ་ན།
en: What is it that is the enjoyment body and not the emanation body?

source: སའི་མདུན་རོལ་གྱི་སྐུ་གང་ཡིན་པའོ།
en: It is a body that is seen on the bhūmis. “

source: །སྤྲུལ་པའི་སྐུ་ཡང་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་ཡིན་པ་གང་ཞེ་ན།
en: What is both the emanation body and the enjoyment body?

source: འདི་ལྟ་སྟེ། ལྷག་མ་དང་བཅས་པའི་མྱ་ངན་ལས་འདས་པ་ལ་གནས་པའི་སྐུ་གང་ཡིན་པའོ།
en: That is the body in the nirvāṇa with a residue. “

source: །སྤྲུལ་པའི་སྐུ་ཡང་མ་ཡིན་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་མ་ཡིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is neither the emanation body nor the enjoyment body?

source: ཆོས་ཀྱི་སྐུ་གང་ཡིན་པའོ།
en: That is the Dharma body. “

source: །རིགས་ཀྱི་བུ་ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ནི་གཉིས་སུ་མེད་པས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་རོ།
en: Noble one, the Dharma body is revealed nonduality.

source: །གཉིས་སུ་མེད་པ་ཞེས་བྱ་བ་ཡང་གང་ཞེ་ན།
en: What is nonduality?

source: ཆོས་ཀྱི་སྐུ་དེ་ལ་མཚན་ཉིད་དང་མཚན་ཉིད་ཀྱི་གནས་ཞེས་བྱ་བ་གཉི་ག་མེད་པས་ཡོད་པ་ཡང་མ་ཡིན་མེད་པ་ཡང་མ་ཡིན། གཅིག་པ་ཡང་མ་ཡིན་ཐ་དད་པ་ཡང་མ་ཡིན། གྲངས་ཀྱང་མ་ཡིན་གྲངས་མ་ཡིན་པ་ཡང་མ་ཡིན། སྣང་བ་ཡང་མ་ཡིན། མུན་པ་ཡང་མ་ཡིན་ཏེ།
en: In the Dharma body, there are neither characteristics nor the basis for characteristics, and so there is neither existence nor nonexistence; the Dharma body is neither single nor diverse; it is neither a number nor numberless; and it is neither light nor darkness. “

source: དེ་ལྟ་བུའི་དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་དེས་ནི་མཚན་ཉིད་དང་མཚན་ཉིད་ཀྱི་གནས་ཀྱང་མི་གཟིགས། ཡོད་པ་ཡང་མ་ཡིན་མེད་པ་ཡང་མ་ཡིན་པ་ཡང་མི་གཟིགས། གཅིག་པ་ཡང་མ་ཡིན་ཐ་དད་པ་ཡང་མ་ཡིན་པ་ཡང་མི་གཟིགས། གྲངས་ཀྱང་མ་ཡིན་གྲངས་མ་ཡིན་པ་ཡང་མི་གཟིགས། སྣང་བ་ཡང་མ་ཡིན།
en: That wisdom of the true nature sees neither characteristics nor a basis for characteristics; it does not see existence or nonexistence; it does not see singularity or differences; it does not see number or absence of number; and it does not see light or darkness. “
